In [1]:
import pandas as pd
data = {
    'Student': ['Idrees','Saufi','Faiz','Dila','Nadirah'],
    'Math': [99, 85, 95, 85, 98],
    'English': [45, 35, 25, 65, 59],
    'Science': [55, 65, 75, 85, 87],
}

df = pd.DataFrame(data)

### Column Selection in Pandas
- `df['column1']` -  target a single column
- `df[['column1','column2','column3']]` - to target a lot of columns at once, you are passing a list of names, instead of one

In [13]:
student_col = df['Student'] # this indexing method, takes only one argument---- string or a list as
student_col = df.Student
student_col # series

student_col_df = df[['Student']]
student_col_df

   Student
0   Idrees
1    Saufi
2     Faiz
3     Dila
4  Nadirah

In [ ]:
# a part of the data frame
cols = ['English','Math','Science']
df[cols] #

subject_cols = df[['English','Math','Science']]
subject_cols

   English  Math  Science
0       45    99       55
1       35    85       65
2       25    95       75
3       65    85       85
4       59    98       87

### Selection by:
- Location  --- `.iloc[ ]`
- selecting by integer location `i` - integer 
- 
- `df.iloc[row index]` # access rows
- `df.iloc[row index, column index]` # access values at = row , column
- `df.iloc[row_start:row_end , col_start:col_end ]` # access === range of rows, range of columns

In [ ]:
df.iloc[:] # works --- gives evrything back
df.iloc[4] # returns a series object
# header turned to index
# getting values for different rows

# slicing will work too
df.iloc[:3]             # first 3 rows

# can we access a limited number of columns too?
# INDEXING

df.iloc[:,:]
df.iloc[:3,:2] # first 3 rows, first 2 columns

df.iloc[0:3, :3] # 0 1 2
df.iloc[0:3, :4] # 0 1 2 3
df.iloc[0:3, 1:2] # 1 

df.iloc[3 , 0 ] # value =  row 3 , column 1  


# we can get any subset of a dataframe like this

'Dila'

#### Exercise

Write a query that returns this subtable:
- rows: 20 to 80
- columns: 3 to 9

In [37]:
df.iloc[20:81, 3:10]

Empty DataFrame
Columns: [Science]
Index: []

**.iloc**
- Label --- `.loc [  ]`
- we go to a location using a `label`
- `df.loc [row_label]` - return a value from that row
- `df.loc[row_label]` # access rows
- `df.loc[row_label, column_label]` # access values at = row , column
- `df.loc[row_start_label:row_end_label , col_start_label:col_end_label ]` # access === range of rows, range of columns

In [ ]:
df.loc[4] # target rows

Student    Nadirah
Math            98
English         59
Science         87
Name: 4, dtype: object

In [55]:
data = {
    'Student': ['Idrees','Saufi','Faiz','Dila','Nadirah'],
    'Math': [99, 85, 95, 85, 98],
    'English': [45, 35, 25, 65, 59],
    'Science': [55, 65, 75, 85, 87],
}

df = pd.DataFrame(data, index = ['stu1','stu2', 'stu3', 'stu4', 'stu5'])

In [56]:
df

      Student  Math  English  Science
stu1   Idrees    99       45       55
stu2    Saufi    85       35       65
stu3     Faiz    95       25       75
stu4     Dila    85       65       85
stu5  Nadirah    98       59       87

In [75]:
df.iloc[4] # iloc still works----- because it target integer locations

#df.loc[5] # won't work
#df.iloc['stu1'] # won't' work

df.loc[:'stu4'] # get all the rows upto stu4

df.loc['stu1': 'stu4', 'Math':'Science'] # setup a range too

      Math  English  Science
stu1    99       45       55
stu2    85       35       65
stu3    95       25       75
stu4    85       65       85

---

## Selection based on DTypes, filter(), List Comprehension
---

- Selection based on DTypes - `df.select_dtypes(include=['number', 'object', 'datetime','bool','str'])`

In [86]:
# Will select only the specified data column types

df.select_dtypes(include=['number','str'], exclude=['object'])

# string type is taken as object type as well
# the difference you remember?????
# object type columns ----- have mixed data types in them
# but these are sometimes taken interchangebaly

      Math  English  Science
stu1    99       45       55
stu2    85       35       65
stu3    95       25       75
stu4    85       65       85
stu5    98       59       87

- Selection using filter method - `df.filter(items = ['Student','Maths'])`

In [88]:
df

      Student  Math  English  Science
stu1   Idrees    99       45       55
stu2    Saufi    85       35       65
stu3     Faiz    95       25       75
stu4     Dila    85       65       85
stu5  Nadirah    98       59       87

In [104]:
df.filter(items = ['Student', 'Math', 'Science','English'])

      Student  Math  Science  English
stu1   Idrees    99       55       45
stu2    Saufi    85       65       35
stu3     Faiz    95       75       25
stu4     Dila    85       85       65
stu5  Nadirah    98       87       59

In [101]:
df.filter(like='Math')

      Math
stu1    99
stu2    85
stu3    95
stu4    85
stu5    98

- Selection using List Comprehension - `cols = [ condition ]` ---> 'df[cols]'

```py 
    [(operation on x) for x in <iterable> (condition)]

In [ ]:
# Revision of ----- List Comprehension
[x for x in range(10)]

[x for x in range(10) if x % 2]

[(3*x + 2) for x in range(10) if x % 2] # [(operation on x) for x in <iterable> (condition)]

[5, 11, 17, 23, 29]

In [134]:
str_cols = [col for col in df.columns if df[col].dtype == 'str' ]
str_cols

num_cols = [col for col in df.columns if df[col].dtype == 'int64' ]
num_cols

['Math', 'English', 'Science']

In [130]:
print(df['Math'].dtype)

int64

In [136]:
num_df = df[num_cols]
num_df

str_df = df[str_cols]
str_df

      Student
stu1   Idrees
stu2    Saufi
stu3     Faiz
stu4     Dila
stu5  Nadirah